qinyunti/py32f403-nes/proj/PY32F403_HAL_Driver/Inc/py32f403_ll_rcc.h
/** @defgroup RCC_LL_EC_MCO Peripheral MCO get clock source
  * @{
  */
#define LL_RCC_MCO_CLKSOURCE             RCC_CFGR_MCO /*!< MCO Clock source selection */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_MCO_DIV  MCO prescaler
  * @{
  */
#define LL_RCC_MCO_DIV_1                  0x00000000U                                                    /*!< MCO not divided */
#define LL_RCC_MCO_DIV_2                  RCC_CFGR1_MCOPRE_0                                             /*!< MCO divided by 2 */
#define LL_RCC_MCO_DIV_4                  RCC_CFGR1_MCOPRE_1                                             /*!< MCO divided by 4 */
#define LL_RCC_MCO_DIV_8                  (RCC_CFGR1_MCOPRE_1 | RCC_CFGR1_MCOPRE_0)                      /*!< MCO divided by 8 */
#define LL_RCC_MCO_DIV_16                 RCC_CFGR1_MCOPRE_2                                             /*!< MCO divided by 16 */
#define LL_RCC_MCO_DIV_32                 (RCC_CFGR1_MCOPRE_2 | RCC_CFGR1_MCOPRE_0)                      /*!< MCO divided by 32 */
#define LL_RCC_MCO_DIV_64                 (RCC_CFGR1_MCOPRE_2 | RCC_CFGR1_MCOPRE_1)                      /*!< MCO divided by 64 */
#define LL_RCC_MCO_DIV_128                (RCC_CFGR1_MCOPRE_2 | RCC_CFGR1_MCOPRE_1 | RCC_CFGR1_MCOPRE_0) /*!< MCO divided by 128 */
/**
  * @}
  */

#if defined(USE_FULL_LL_DRIVER)
/** @defgroup RCC_LL_EC_PERIPH_FREQUENCY Peripheral clock frequency
  * @{
  */
#define LL_RCC_PERIPH_FREQUENCY_NO        0x00000000U                 /*!< No clock enabled for the peripheral            */
#define LL_RCC_PERIPH_FREQUENCY_NA        0xFFFFFFFFU                 /*!< Frequency cannot be provided as external clock */
/**
  * @}
  */
#endif /* USE_FULL_LL_DRIVER */

#if defined(CANFD)
/** @defgroup RCC_LL_EC_CANFD_CLKSOURCE Peripheral CANFD clock source selection
  * @{
  */
#define LL_RCC_CANFD_CLKSOURCE_PLL       0x00000000U                                                           /*!< PLL clock selected as CANFD clock */
#define LL_RCC_CANFD_CLKSOURCE_PLL_DIV2  RCC_CFGR2_CANCKSEL_0                                                  /*!< PLL/2 clock selected as CANFD clock */
#define LL_RCC_CANFD_CLKSOURCE_PLL_DIV3  RCC_CFGR2_CANCKSEL_1                                                  /*!< PLL/3 clock selected as CANFD clock */
#define LL_RCC_CANFD_CLKSOURCE_PLL_DIV4  (RCC_CFGR2_CANCKSEL_1 | RCC_CFGR2_CANCKSEL_0)                         /*!< PLL/4 clock selected as CANFD clock */
#define LL_RCC_CANFD_CLKSOURCE_PLL_DIV5  RCC_CFGR2_CANCKSEL_2                                                  /*!< PLL/5 clock selected as CANFD clock */
#define LL_RCC_CANFD_CLKSOURCE_PLL_DIV6  (RCC_CFGR2_CANCKSEL_2 | RCC_CFGR2_CANCKSEL_0)                         /*!< PLL/6 clock selected as CANFD clock */
#define LL_RCC_CANFD_CLKSOURCE_PLL_DIV7  (RCC_CFGR2_CANCKSEL_2 | RCC_CFGR2_CANCKSEL_1)                         /*!< PLL/7 clock selected as CANFD clock */
#define LL_RCC_CANFD_CLKSOURCE_PLL_DIV8  (RCC_CFGR2_CANCKSEL_2 | RCC_CFGR2_CANCKSEL_1 | RCC_CFGR2_CANCKSEL_0)  /*!< PLL/8 clock selected as CANFD clock */
#define LL_RCC_CANFD_CLKSOURCE_HSE       RCC_CFGR2_CANCKSEL_3                                                  /*!< HSE clock selected as CANFD clock */
/**
  * @}
  */
#endif /* CANFD */

#if defined(RCC_BDCR_RTCSEL)
/** @defgroup RCC_LL_EC_RTC_CLKSOURCE  RTC clock source selection
  * @{
  */
#define LL_RCC_RTC_CLKSOURCE_NONE          0x00000000U             /*!< No clock used as RTC clock */
#if defined(RCC_LSE_SUPPORT)
#define LL_RCC_RTC_CLKSOURCE_LSE           RCC_BDCR_RTCSEL_0       /*!< LSE oscillator clock used as RTC clock */
#endif
#define LL_RCC_RTC_CLKSOURCE_LSI           RCC_BDCR_RTCSEL_1       /*!< LSI oscillator clock used as RTC clock */
#define LL_RCC_RTC_CLKSOURCE_HSE_DIV128    RCC_BDCR_RTCSEL         /*!< HSE oscillator clock divided by 128 used as RTC clock */
/**
  * @}
  */
#endif

/** @defgroup RCC_LL_EC_USB_CLKSOURCE  Peripheral USB clock source selection
  * @{
  */
#define LL_RCC_USB_CLKSOURCE_PLL           0x00000000U            /*!< PLL clock used as USB clock source */
#define LL_RCC_USB_CLKSOURCE_HSI48         RCC_CFGR1_USBSELHSI48  /*!< HSI48 clock used as USB clock source */
/**
  * @}
  */
  
/** @defgroup RCC_LL_EC_USB_Prediv  Peripheral USB clock prescaler
  * @{
  */
#define LL_RCC_USB_DIV_1P5            0x00000000U                              /*!< USB divided by 1.5 */
#define LL_RCC_USB_DIV_1              RCC_CFGR_USBPRE_0                        /*!< USB divided by 1   */
#define LL_RCC_USB_DIV_2P5            RCC_CFGR_USBPRE_1                        /*!< USB divided by 2.5 */
#define LL_RCC_USB_DIV_2              (RCC_CFGR_USBPRE_1 | RCC_CFGR_USBPRE_0)  /*!< USB divided by 2 */
#define LL_RCC_USB_DIV_3              RCC_CFGR_USBPRE_2                        /*!< USB divided by 3 */
#define LL_RCC_USB_DIV_3P5            (RCC_CFGR_USBPRE_2 | RCC_CFGR_USBPRE_0)  /*!< USB divided by 3.5 */
#define LL_RCC_USB_DIV_4              (RCC_CFGR_USBPRE_2 | RCC_CFGR_USBPRE_1)  /*!< USB divided by 4 */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_ADC_CLKSOURCE  Peripheral ADC clock source selection
  * @{
  */
#define LL_RCC_ADC_CLKSOURCE_PCLK2_DIV2       RCC_CFGR_ADCPRE_DIV2                    /*!< PCLK/2 clock selected as ADC clock */
#define LL_RCC_ADC_CLKSOURCE_PCLK2_DIV4       RCC_CFGR_ADCPRE_DIV4                    /*!< PCLK/4 clock selected as ADC clock */
#define LL_RCC_ADC_CLKSOURCE_PCLK2_DIV6       RCC_CFGR_ADCPRE_DIV6                    /*!< PCLK/6 clock selected as ADC clock */
#define LL_RCC_ADC_CLKSOURCE_PCLK2_DIV8       RCC_CFGR_ADCPRE_DIV8                    /*!< PCLK/8 clock selected as ADC clock */
#define LL_RCC_ADC_CLKSOURCE_PCLK2_DIV12      RCC_CFGR_ADCPRE_DIV12                   /*!< PCLK/12 clock selected as ADC clock */
#define LL_RCC_ADC_CLKSOURCE_PCLK2_DIV16      RCC_CFGR_ADCPRE_DIV16                   /*!< PCLK/16 clock selected as ADC clock */
/**
  * @}
  */

#if defined(RCC_PLL_SUPPORT)
/** @defgroup RCC_LL_EC_PLLSOURCE  PLL entry clock source
  * @{
  */
#define LL_RCC_PLLSOURCE_HSI               0x00000000U                                   /*!< HSI clock selected as PLL entry clock source */
#define LL_RCC_PLLSOURCE_HSI_DIV1          LL_RCC_PLLSOURCE_HSI                          /*!< HSI clock selected as PLL entry clock source */
#define LL_RCC_PLLSOURCE_HSE               RCC_CFGR_PLLSRC                               /*!< HSE clock selected as PLL entry clock source */
#define LL_RCC_PLLSOURCE_HSE_DIV1          LL_RCC_PLLSOURCE_HSE                          /*!< HSE clock selected as PLL entry clock source */
#define LL_RCC_PLLSOURCE_HSE_DIV2          (RCC_CFGR_PLLSRC | RCC_CFGR_PLLXTPRE)         /*!< HSE/2 clock selected as PLL entry clock source */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_PLLMUL  PLL Multiplication Factor
  * @{
  */
#define LL_RCC_PLLMUL_2                    RCC_CFGR_PLLMULL2      /* The PLL multiplication factor is 2 */
#define LL_RCC_PLLMUL_3                    RCC_CFGR_PLLMULL3      /* The PLL multiplication factor is 3 */
#define LL_RCC_PLLMUL_4                    RCC_CFGR_PLLMULL4      /* The PLL multiplication factor is 4 */
#define LL_RCC_PLLMUL_5                    RCC_CFGR_PLLMULL5      /* The PLL multiplication factor is 5 */
#define LL_RCC_PLLMUL_6                    RCC_CFGR_PLLMULL6      /* The PLL multiplication factor is 6 */
#define LL_RCC_PLLMUL_7                    RCC_CFGR_PLLMULL7      /* The PLL multiplication factor is 7 */
#define LL_RCC_PLLMUL_8                    RCC_CFGR_PLLMULL8      /* The PLL multiplication factor is 8 */
#define LL_RCC_PLLMUL_9                    RCC_CFGR_PLLMULL9      /* The PLL multiplication factor is 9 */
#define LL_RCC_PLLMUL_10                   RCC_CFGR_PLLMULL10     /* The PLL multiplication factor is 10 */
#define LL_RCC_PLLMUL_11                   RCC_CFGR_PLLMULL11     /* The PLL multiplication factor is 11 */
#define LL_RCC_PLLMUL_12                   RCC_CFGR_PLLMULL12     /* The PLL multiplication factor is 12 */
#define LL_RCC_PLLMUL_13                   RCC_CFGR_PLLMULL13     /* The PLL multiplication factor is 13 */
#define LL_RCC_PLLMUL_14                   RCC_CFGR_PLLMULL14     /* The PLL multiplication factor is 14 */
#define LL_RCC_PLLMUL_15                   RCC_CFGR_PLLMULL15     /* The PLL multiplication factor is 15 */
#define LL_RCC_PLLMUL_16                   RCC_CFGR_PLLMULL16     /* The PLL multiplication factor is 16 */
#define LL_RCC_PLLMUL_17                   RCC_CFGR_PLLMULL17     /* The PLL multiplication factor is 17 */
#define LL_RCC_PLLMUL_18                   RCC_CFGR_PLLMULL18     /* The PLL multiplication factor is 18 */
#define LL_RCC_PLLMUL_19                   RCC_CFGR_PLLMULL19     /* The PLL multiplication factor is 19 */
#define LL_RCC_PLLMUL_20                   RCC_CFGR_PLLMULL20     /* The PLL multiplication factor is 20 */
#define LL_RCC_PLLMUL_21                   RCC_CFGR_PLLMULL21     /* The PLL multiplication factor is 21 */
/**
  * @}
  */
  
/** @defgroup RCC_LL_EC_PREDIV_DIV PREDIV Division factor
  * @{
  */
#define LL_RCC_PREDIV_DIV_1                0x00000000U              /*!< HSE divider clock clock not divided */
#define LL_RCC_PREDIV_DIV_2                RCC_CFGR_PLLXTPRE        /*!< HSE divider clock divided by 2 for PLL entry */
/**
  * @}
  */
#endif

/** @defgroup RCC_HSE_EC_Freq HSE Config
  * @{
  */
#define LL_RCC_HSE_4_6MHz                 0x00000000U
#define LL_RCC_HSE_4_8MHz                 RCC_CFGR2_HSEDRV_0
#define LL_RCC_HSE_8_16MHz                RCC_CFGR2_HSEDRV_1
#define LL_RCC_HSE_16_32MHz               (RCC_CFGR2_HSEDRV_1 | RCC_CFGR2_HSEDRV_0)
/**
  * @}
  */

/**
  * @}
  */

/* Exported macro ------------------------------------------------------------*/
/** @defgroup RCC_LL_Exported_Macros RCC Exported Macros
  * @{
  */

