qinyunti/py32f403-nes/proj/PY32F403_HAL_Driver/Inc/py32f403_ll_rcc.h
/** @defgroup RCC_LL_EF_RSTOUT RSTOUT
  * @{
  */
/**
  * @brief  Enable Reset Output
  * @rmtoll BDCR          RCC_BDCR_RSTOUT_DIS         LL_RCC_RSTOUT_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_RSTOUT_Enable(void)
{
  CLEAR_BIT(RCC->BDCR, RCC_BDCR_RSTOUT_DIS);
}

/**
  * @brief  Disable Reset Output
  * @rmtoll BDCR          RCC_BDCR_RSTOUT_DIS         LL_RCC_RSTOUT_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_RSTOUT_Disable(void)
{
  SET_BIT(RCC->BDCR, RCC_BDCR_RSTOUT_DIS);
}
/**
  * @}
  */

/** @defgroup RCC_LL_EF_LSI LSI
  * @{
  */

/**
  * @brief  Enable LSI Oscillator
  * @rmtoll CSR          LSION         LL_RCC_LSI_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LSI_Enable(void)
{
  SET_BIT(RCC->CSR, RCC_CSR_LSION);
}

/**
  * @brief  Disable LSI Oscillator
  * @rmtoll CSR          LSION         LL_RCC_LSI_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LSI_Disable(void)
{
  CLEAR_BIT(RCC->CSR, RCC_CSR_LSION);
}

/**
  * @brief  Check if LSI is Ready
  * @rmtoll CSR          LSIRDY        LL_RCC_LSI_IsReady
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_LSI_IsReady(void)
{
  return ((READ_BIT(RCC->CSR, RCC_CSR_LSIRDY) == (RCC_CSR_LSIRDY)) ? 1UL : 0UL);
}

/**
  * @}
  */

/** @defgroup RCC_LL_EF_System System
  * @{
  */

/**
  * @brief  Configure the system clock source
  * @rmtoll CFGR         SW            LL_RCC_SetSysClkSource
  * @param  Source This parameter can be one of the following values:
  *         @arg @ref LL_RCC_SYS_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_SYS_CLKSOURCE_HSE
  *         @arg @ref LL_RCC_SYS_CLKSOURCE_PLL
  * @note   Depending on devices and packages, some clocks may not be available.
  *         Refer to device datasheet for clocks availability.
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetSysClkSource(uint32_t Source)
{
  MODIFY_REG(RCC->CFGR, RCC_CFGR_SW, Source);
}

/**
  * @brief  Get the system clock source
  * @rmtoll CFGR         SWS           LL_RCC_GetSysClkSource
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_SYS_CLKSOURCE_STATUS_HSI
  *         @arg @ref LL_RCC_SYS_CLKSOURCE_STATUS_HSE
  *         @arg @ref LL_RCC_SYS_CLKSOURCE_STATUS_PLL
  * @note   Depending on devices and packages, some clocks may not be available.
  *         Refer to device datasheet for clocks availability.
  */
__STATIC_INLINE uint32_t LL_RCC_GetSysClkSource(void)
{
  return (uint32_t)(READ_BIT(RCC->CFGR, RCC_CFGR_SWS));
}

/**
  * @brief  Set AHB prescaler
  * @rmtoll CFGR         HPRE          LL_RCC_SetAHBPrescaler
  * @param  Prescaler This parameter can be one of the following values:
  *         @arg @ref LL_RCC_SYSCLK_DIV_1
  *         @arg @ref LL_RCC_SYSCLK_DIV_2
  *         @arg @ref LL_RCC_SYSCLK_DIV_4
  *         @arg @ref LL_RCC_SYSCLK_DIV_8
  *         @arg @ref LL_RCC_SYSCLK_DIV_16
  *         @arg @ref LL_RCC_SYSCLK_DIV_64
  *         @arg @ref LL_RCC_SYSCLK_DIV_128
  *         @arg @ref LL_RCC_SYSCLK_DIV_256
  *         @arg @ref LL_RCC_SYSCLK_DIV_512
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetAHBPrescaler(uint32_t Prescaler)
{
  MODIFY_REG(RCC->CFGR, RCC_CFGR_HPRE, Prescaler);
}

/**
  * @brief  Set APB1 prescaler
  * @rmtoll CFGR         PPRE1         LL_RCC_SetAPB1Prescaler
  * @param  Prescaler This parameter can be one of the following values:
  *         @arg @ref LL_RCC_APB1_DIV_1
  *         @arg @ref LL_RCC_APB1_DIV_2
  *         @arg @ref LL_RCC_APB1_DIV_4
  *         @arg @ref LL_RCC_APB1_DIV_8
  *         @arg @ref LL_RCC_APB1_DIV_16
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetAPB1Prescaler(uint32_t Prescaler)
{
  MODIFY_REG(RCC->CFGR, RCC_CFGR_PPRE1, Prescaler);
}

/**
  * @brief  Set APB2 prescaler
  * @rmtoll CFGR         PPRE2         LL_RCC_SetAPB2Prescaler
  * @param  Prescaler This parameter can be one of the following values:
  *         @arg @ref LL_RCC_APB2_DIV_1
  *         @arg @ref LL_RCC_APB2_DIV_2
  *         @arg @ref LL_RCC_APB2_DIV_4
  *         @arg @ref LL_RCC_APB2_DIV_8
  *         @arg @ref LL_RCC_APB2_DIV_16
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetAPB2Prescaler(uint32_t Prescaler)
{
  MODIFY_REG(RCC->CFGR, RCC_CFGR_PPRE2, Prescaler);
}

/**
  * @brief  Get AHB prescaler
  * @rmtoll CFGR         HPRE          LL_RCC_GetAHBPrescaler
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_SYSCLK_DIV_1
  *         @arg @ref LL_RCC_SYSCLK_DIV_2
  *         @arg @ref LL_RCC_SYSCLK_DIV_4
  *         @arg @ref LL_RCC_SYSCLK_DIV_8
  *         @arg @ref LL_RCC_SYSCLK_DIV_16
  *         @arg @ref LL_RCC_SYSCLK_DIV_64
  *         @arg @ref LL_RCC_SYSCLK_DIV_128
  *         @arg @ref LL_RCC_SYSCLK_DIV_256
  *         @arg @ref LL_RCC_SYSCLK_DIV_512
  */
__STATIC_INLINE uint32_t LL_RCC_GetAHBPrescaler(void)
{
  return (uint32_t)(READ_BIT(RCC->CFGR, RCC_CFGR_HPRE));
}

/**
  * @brief  Get APB1 prescaler
  * @rmtoll CFGR         PPRE1         LL_RCC_GetAPB1Prescaler
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_APB1_DIV_1
  *         @arg @ref LL_RCC_APB1_DIV_2
  *         @arg @ref LL_RCC_APB1_DIV_4
  *         @arg @ref LL_RCC_APB1_DIV_8
  *         @arg @ref LL_RCC_APB1_DIV_16
  */
__STATIC_INLINE uint32_t LL_RCC_GetAPB1Prescaler(void)
{
  return (uint32_t)(READ_BIT(RCC->CFGR, RCC_CFGR_PPRE1));
}

/**
  * @brief  Get APB2 prescaler
  * @rmtoll CFGR         PPRE2         LL_RCC_GetAPB2Prescaler
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_APB2_DIV_1
  *         @arg @ref LL_RCC_APB2_DIV_2
  *         @arg @ref LL_RCC_APB2_DIV_4
  *         @arg @ref LL_RCC_APB2_DIV_8
  *         @arg @ref LL_RCC_APB2_DIV_16
  */
__STATIC_INLINE uint32_t LL_RCC_GetAPB2Prescaler(void)
{
  return (uint32_t)(READ_BIT(RCC->CFGR, RCC_CFGR_PPRE2));
}

/**
  * @}
  */

/** @defgroup RCC_LL_EF_MCO MCO
  * @{
  */

/**
  * @brief  Configure MCOx
  * @rmtoll CFGR         MCOSEL        LL_RCC_ConfigMCO\n
  *         CFGR1        MCOPRE        LL_RCC_ConfigMCO
  * @param  MCOxSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_MCOSOURCE_NOCLOCK
  *         @arg @ref LL_RCC_MCOSOURCE_LSE
  *         @arg @ref LL_RCC_MCOSOURCE_LSI
  *         @arg @ref LL_RCC_MCOSOURCE_HSI48M
  *         @arg @ref LL_RCC_MCOSOURCE_SYSCLK
  *         @arg @ref LL_RCC_MCOSOURCE_HSI
  *         @arg @ref LL_RCC_MCOSOURCE_HSE
  *         @arg @ref LL_RCC_MCOSOURCE_PLL
  * @note   Depending on devices and packages, some clocks may not be available.
  *         Refer to device datasheet for clocks availability.
  * @param  MCOxPrescaler This parameter can be one of the following values:
  *         @arg @ref LL_RCC_MCO_DIV_1
  *         @arg @ref LL_RCC_MCO_DIV_2
  *         @arg @ref LL_RCC_MCO_DIV_4
  *         @arg @ref LL_RCC_MCO_DIV_8
  *         @arg @ref LL_RCC_MCO_DIV_16
  *         @arg @ref LL_RCC_MCO_DIV_32
  *         @arg @ref LL_RCC_MCO_DIV_64
  *         @arg @ref LL_RCC_MCO_DIV_128
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ConfigMCO(uint32_t MCOxSource, uint32_t MCOxPrescaler)
{
  MODIFY_REG(RCC->CFGR, RCC_CFGR_MCO, MCOxSource);
  MODIFY_REG(RCC->CFGR1, RCC_CFGR1_MCOPRE,  MCOxPrescaler);
}

/**
  * @brief  Get MCO clock source
  * @rmtoll CFGR         MCOSEL       LL_RCC_GetMCOClockSource
  * @param  MCOx This parameter can be one of the following values:
  *         @arg @ref LL_RCC_MCO_CLKSOURCE
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_MCOSOURCE_NOCLOCK
  *         @arg @ref LL_RCC_MCOSOURCE_LSE
  *         @arg @ref LL_RCC_MCOSOURCE_LSI
  *         @arg @ref LL_RCC_MCOSOURCE_HSI48M
  *         @arg @ref LL_RCC_MCOSOURCE_SYSCLK
  *         @arg @ref LL_RCC_MCOSOURCE_HSI
  *         @arg @ref LL_RCC_MCOSOURCE_HSE
  *         @arg @ref LL_RCC_MCOSOURCE_PLL
  * @note   Depending on devices and packages, some clocks may not be available.
  *         Refer to device datasheet for clocks availability.
  */
__STATIC_INLINE uint32_t LL_RCC_GetMCOClockSource(uint32_t MCOx)
{
  return (uint32_t)(READ_BIT(RCC->CFGR, MCOx));
}

/**
  * @brief  Get MCO division factor
  * @rmtoll CFGR         MCOPRE        LL_RCC_GetMCODiv
  * @param  MCOx This parameter can be one of the following values:
  *         @arg @ref LL_RCC_MCO_CLKSOURCE
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_MCO_DIV_1
  *         @arg @ref LL_RCC_MCO_DIV_2
  *         @arg @ref LL_RCC_MCO_DIV_4
  *         @arg @ref LL_RCC_MCO_DIV_8
  *         @arg @ref LL_RCC_MCO_DIV_16
  *         @arg @ref LL_RCC_MCO_DIV_32
  *         @arg @ref LL_RCC_MCO_DIV_64
  *         @arg @ref LL_RCC_MCO_DIV_128
  */
__STATIC_INLINE uint32_t LL_RCC_GetMCODiv(uint32_t MCOx)
{
  return (uint32_t)(READ_BIT(RCC->CFGR1, RCC_CFGR1_MCOPRE));
}

/**
  * @}
  */

/** @defgroup RCC_LL_EF_Peripheral_Clock_Source Peripheral Clock Source
  * @{
  */

#if defined(CANFD)
/**
  * @brief  Configure CANFD clock source
  * @param  CANFDSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_CANFD_CLKSOURCE_PLL
  *         @arg @ref LL_RCC_CANFD_CLKSOURCE_PLL_DIV2
  *         @arg @ref LL_RCC_CANFD_CLKSOURCE_PLL_DIV3
  *         @arg @ref LL_RCC_CANFD_CLKSOURCE_PLL_DIV4
  *         @arg @ref LL_RCC_CANFD_CLKSOURCE_PLL_DIV5
  *         @arg @ref LL_RCC_CANFD_CLKSOURCE_PLL_DIV6
  *         @arg @ref LL_RCC_CANFD_CLKSOURCE_PLL_DIV7
  *         @arg @ref LL_RCC_CANFD_CLKSOURCE_PLL_DIV8
  *         @arg @ref LL_RCC_CANFD_CLKSOURCE_HSE
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetCANFDClockSource(uint32_t CANFDSource)
{
  MODIFY_REG(RCC->CFGR2, RCC_CFGR2_CANCKSEL, CANFDSource);
}

/**
  * @brief  Get CANFD clock source
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_CANFD_CLKSOURCE_PLL
  *         @arg @ref LL_RCC_CANFD_CLKSOURCE_PLL_DIV2
  *         @arg @ref LL_RCC_CANFD_CLKSOURCE_PLL_DIV3
  *         @arg @ref LL_RCC_CANFD_CLKSOURCE_PLL_DIV4
  *         @arg @ref LL_RCC_CANFD_CLKSOURCE_PLL_DIV5
  *         @arg @ref LL_RCC_CANFD_CLKSOURCE_PLL_DIV6
  *         @arg @ref LL_RCC_CANFD_CLKSOURCE_PLL_DIV7
  *         @arg @ref LL_RCC_CANFD_CLKSOURCE_PLL_DIV8
  *         @arg @ref LL_RCC_CANFD_CLKSOURCE_HSE
  */
__STATIC_INLINE uint32_t LL_RCC_GetCANFDClockSource(void)
{
  return (uint32_t)(READ_BIT(RCC->CFGR2, RCC_CFGR2_CANCKSEL));
}
#endif /* CANFD */

/**
  * @brief  Set ADC Clock Source
  * @param  Source This parameter can be one of the following values:
  *         @arg @ref LL_RCC_ADC_CLKSOURCE_PCLK2_DIV2
  *         @arg @ref LL_RCC_ADC_CLKSOURCE_PCLK2_DIV4
  *         @arg @ref LL_RCC_ADC_CLKSOURCE_PCLK2_DIV6
  *         @arg @ref LL_RCC_ADC_CLKSOURCE_PCLK2_DIV8
  *         @arg @ref LL_RCC_ADC_CLKSOURCE_PCLK2_DIV12
  *         @arg @ref LL_RCC_ADC_CLKSOURCE_PCLK2_DIV16
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetADCClockSource(uint32_t Source)
{
  MODIFY_REG(RCC->CFGR, RCC_CFGR_ADCPRE, Source);
}

/**
  * @brief  Get ADC Clock Source
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_ADC_CLKSOURCE_PCLK2_DIV2
  *         @arg @ref LL_RCC_ADC_CLKSOURCE_PCLK2_DIV4
  *         @arg @ref LL_RCC_ADC_CLKSOURCE_PCLK2_DIV6
  *         @arg @ref LL_RCC_ADC_CLKSOURCE_PCLK2_DIV8
  *         @arg @ref LL_RCC_ADC_CLKSOURCE_PCLK2_DIV12
  *         @arg @ref LL_RCC_ADC_CLKSOURCE_PCLK2_DIV16
  */
__STATIC_INLINE uint32_t LL_RCC_GetADCClockSource(void)
{
  return (uint32_t)(READ_BIT(RCC->CFGR, RCC_CFGR_ADCPRE));
}

/**
  * @brief  Configure USB clock source
  * @rmtoll CFGR1        USBSELHSI48      LL_RCC_SetUSBClockSource
  * @param  USBxSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_USB_CLKSOURCE_HSI48
  *         @arg @ref LL_RCC_USB_CLKSOURCE_PLL
  *
  *         (*) value not defined in all devices.
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetUSBClockSource(uint32_t USBxSource)
{
  MODIFY_REG(RCC->CFGR1, RCC_CFGR1_USBSELHSI48, USBxSource);
}

/**
  * @brief  Get USBx clock source
  * @rmtoll CFGR1        USBSELHSI48        LL_RCC_GetUSBClockSource
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_USB_CLKSOURCE_HSI48
  *         @arg @ref LL_RCC_USB_CLKSOURCE_PLL
  */
__STATIC_INLINE uint32_t LL_RCC_GetUSBClockSource(void)
{
  return (uint32_t)(READ_BIT(RCC->CFGR1, RCC_CFGR1_USBSELHSI48));
}

/**
  * @brief  Configure USB clock source
  * @rmtoll CFGR1        USBPRE      LL_RCC_SetUSBPrescaler
  * @param  Prescaler This parameter can be one of the following values:
  *         @arg @ref LL_RCC_USB_DIV_1P5
  *         @arg @ref LL_RCC_USB_DIV_1
  *         @arg @ref LL_RCC_USB_DIV_2P5
  *         @arg @ref LL_RCC_USB_DIV_2
  *         @arg @ref LL_RCC_USB_DIV_3
  *         @arg @ref LL_RCC_USB_DIV_3P5
  *         @arg @ref LL_RCC_USB_DIV_4
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetUSBPrescaler(uint32_t Prescaler)
{
  MODIFY_REG(RCC->CFGR, RCC_CFGR_USBPRE, Prescaler);
}

/**
  * @brief  Configure USB clock source
  * @rmtoll CFGR1        USBPRE      LL_RCC_SetUSBPrescaler
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_USB_DIV_1P5
  *         @arg @ref LL_RCC_USB_DIV_1
  *         @arg @ref LL_RCC_USB_DIV_2P5
  *         @arg @ref LL_RCC_USB_DIV_2
  *         @arg @ref LL_RCC_USB_DIV_3
  *         @arg @ref LL_RCC_USB_DIV_3P5
  *         @arg @ref LL_RCC_USB_DIV_4
  * @retval None
  */
__STATIC_INLINE uint32_t LL_RCC_GetUSBPrescaler(void)
{
  return (uint32_t)(READ_BIT(RCC->CFGR, RCC_CFGR_USBPRE));
}

/**
  * @}
  */
#if defined(RTC)
#if defined(RCC_BDCR_RTCSEL)
/** @defgroup RCC_LL_EF_RTC RTC
  * @{
  */

/**
  * @brief  Set RTC Clock Source
  * @note Once the RTC clock source has been selected, it cannot be changed anymore unless
  *       the Backup domain is reset, or unless a failure is detected on LSE (LSECSSD is
  *       set). The BDRST bit can be used to reset them.
  * @rmtoll BDCR         RTCSEL        LL_RCC_SetRTCClockSource
  * @param  Source This parameter can be one of the following values:
  *         @arg @ref LL_RCC_RTC_CLKSOURCE_NONE
  *         @arg @ref LL_RCC_RTC_CLKSOURCE_LSE
  *         @arg @ref LL_RCC_RTC_CLKSOURCE_LSI
  *         @arg @ref LL_RCC_RTC_CLKSOURCE_HSE_DIV128
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetRTCClockSource(uint32_t Source)
{
  MODIFY_REG(RCC->BDCR, RCC_BDCR_RTCSEL, Source);
}

/**
  * @brief  Get RTC Clock Source
  * @rmtoll BDCR         RTCSEL        LL_RCC_GetRTCClockSource
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_RTC_CLKSOURCE_NONE
  *         @arg @ref LL_RCC_RTC_CLKSOURCE_LSE
  *         @arg @ref LL_RCC_RTC_CLKSOURCE_LSI
  *         @arg @ref LL_RCC_RTC_CLKSOURCE_HSE_DIV128
  */
__STATIC_INLINE uint32_t LL_RCC_GetRTCClockSource(void)
{
  return (uint32_t)(READ_BIT(RCC->BDCR, RCC_BDCR_RTCSEL));
}
#endif
/**
  * @brief  Enable RTC
  * @rmtoll BDCR         RTCEN         LL_RCC_EnableRTC
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableRTC(void)
{
  SET_BIT(RCC->BDCR, RCC_BDCR_RTCEN);
}

/**
  * @brief  Disable RTC
  * @rmtoll BDCR         RTCEN         LL_RCC_DisableRTC
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableRTC(void)
{
  CLEAR_BIT(RCC->BDCR, RCC_BDCR_RTCEN);
}

/**
  * @brief  Check if RTC has been enabled or not
  * @rmtoll BDCR         RTCEN         LL_RCC_IsEnabledRTC
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsEnabledRTC(void)
{
  return ((READ_BIT(RCC->BDCR, RCC_BDCR_RTCEN) == (RCC_BDCR_RTCEN)) ? 1UL : 0UL);
}

/**
  * @brief  Force the Backup domain reset
  * @rmtoll BDCR         BDRST         LL_RCC_ForceBackupDomainReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ForceBackupDomainReset(void)
{
  SET_BIT(RCC->BDCR, RCC_BDCR_BDRST);
}

/**
  * @brief  Release the Backup domain reset
  * @rmtoll BDCR         BDRST         LL_RCC_ReleaseBackupDomainReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ReleaseBackupDomainReset(void)
{
  CLEAR_BIT(RCC->BDCR, RCC_BDCR_BDRST);
}

/**
  * @}
  */
#endif

#if defined(RCC_PLL_SUPPORT)
/** @defgroup RCC_LL_EF_PLL PLL
  * @{
  */

/**
  * @brief  Enable PLL
  * @rmtoll CR           PLLON         LL_RCC_PLL_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL_Enable(void)
{
  SET_BIT(RCC->CR, RCC_CR_PLLON);
}

/**
  * @brief  Disable PLL
  * @note Cannot be disabled if the PLL clock is used as the system clock
  * @rmtoll CR           PLLON         LL_RCC_PLL_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL_Disable(void)
{
  CLEAR_BIT(RCC->CR, RCC_CR_PLLON);
}

/**
  * @brief  Check if PLL Ready
  * @rmtoll CR           PLLRDY        LL_RCC_PLL_IsReady
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_PLL_IsReady(void)
{
  return ((READ_BIT(RCC->CR, RCC_CR_PLLRDY) == (RCC_CR_PLLRDY)) ? 1UL : 0UL);
}

/**
  * @brief  Configure PLL used for SYSCLK Domain
  * @rmtoll CFGR         PLLSRC        LL_RCC_PLL_ConfigDomain_SYS\n
  *         CFGR         PLLXTPRE      LL_RCC_PLL_ConfigDomain_SYS\n
  *         CFGR         PLLMULL       LL_RCC_PLL_ConfigDomain_SYS\n
  * @param  Source This parameter can be one of the following values:
  *         @arg @ref LL_RCC_PLLSOURCE_HSI_DIV1
  *         @arg @ref LL_RCC_PLLSOURCE_HSE_DIV1
  *         @arg @ref LL_RCC_PLLSOURCE_HSE_DIV2
  * @param  PLLMul This parameter can be one of the following values:
  *         @arg @ref LL_RCC_PLLMUL_2
  *         @arg @ref LL_RCC_PLLMUL_3
  *         @arg @ref LL_RCC_PLLMUL_4
  *         @arg @ref LL_RCC_PLLMUL_5
  *         @arg @ref LL_RCC_PLLMUL_6
  *         @arg @ref LL_RCC_PLLMUL_7
  *         @arg @ref LL_RCC_PLLMUL_8
  *         @arg @ref LL_RCC_PLLMUL_9
  *         @arg @ref LL_RCC_PLLMUL_10
  *         @arg @ref LL_RCC_PLLMUL_11
  *         @arg @ref LL_RCC_PLLMUL_12
  *         @arg @ref LL_RCC_PLLMUL_13
  *         @arg @ref LL_RCC_PLLMUL_14
  *         @arg @ref LL_RCC_PLLMUL_15
  *         @arg @ref LL_RCC_PLLMUL_16
  *         @arg @ref LL_RCC_PLLMUL_17
  *         @arg @ref LL_RCC_PLLMUL_18
  *         @arg @ref LL_RCC_PLLMUL_19
  *         @arg @ref LL_RCC_PLLMUL_20
  *         @arg @ref LL_RCC_PLLMUL_21
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL_ConfigDomain_SYS(uint32_t Source, uint32_t PLLMul)
{
  MODIFY_REG(RCC->CFGR, RCC_CFGR_PLLSRC | RCC_CFGR_PLLXTPRE | RCC_CFGR_PLLMULL, Source | PLLMul);
}

/**
  * @brief  Configure PLL clock source
  * @rmtoll CFGR      PLLSRC        LL_RCC_PLL_SetMainSource
  * @param PLLSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_PLLSOURCE_HSI
  *         @arg @ref LL_RCC_PLLSOURCE_HSE
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL_SetMainSource(uint32_t PLLSource)
{
  MODIFY_REG(RCC->CFGR, RCC_CFGR_PLLSRC, PLLSource);
}

/**
  * @brief  Get the oscillator used as PLL clock source.
  * @rmtoll CFGR      PLLSRC        LL_RCC_PLL_GetMainSource
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_PLLSOURCE_HSI
  *         @arg @ref LL_RCC_PLLSOURCE_HSE
  */
__STATIC_INLINE uint32_t LL_RCC_PLL_GetMainSource(void)
{
  return (uint32_t)(READ_BIT(RCC->CFGR, RCC_CFGR_PLLSRC));
}

/**
  * @brief  Configure PLL Multiplication Factor.
  * @param PLLMul This parameter can be one of the following values:
  *         @arg @ref LL_RCC_PLLMUL_2
  *         @arg @ref LL_RCC_PLLMUL_3
  *         @arg @ref LL_RCC_PLLMUL_4
  *         @arg @ref LL_RCC_PLLMUL_5
  *         @arg @ref LL_RCC_PLLMUL_6
  *         @arg @ref LL_RCC_PLLMUL_7
  *         @arg @ref LL_RCC_PLLMUL_8
  *         @arg @ref LL_RCC_PLLMUL_9
  *         @arg @ref LL_RCC_PLLMUL_10
  *         @arg @ref LL_RCC_PLLMUL_11
  *         @arg @ref LL_RCC_PLLMUL_12
  *         @arg @ref LL_RCC_PLLMUL_13
  *         @arg @ref LL_RCC_PLLMUL_14
  *         @arg @ref LL_RCC_PLLMUL_15
  *         @arg @ref LL_RCC_PLLMUL_16
  *         @arg @ref LL_RCC_PLLMUL_17
  *         @arg @ref LL_RCC_PLLMUL_18
  *         @arg @ref LL_RCC_PLLMUL_19
  *         @arg @ref LL_RCC_PLLMUL_20
  *         @arg @ref LL_RCC_PLLMUL_21
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL_SetMulFactor(uint32_t PLLMul)
{
  MODIFY_REG(RCC->CFGR, RCC_CFGR_PLLMULL, PLLMul);
}

/**
  * @brief  Get the PLL Multiplication Factor.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_PLLMUL_2
  *         @arg @ref LL_RCC_PLLMUL_3
  *         @arg @ref LL_RCC_PLLMUL_4
  *         @arg @ref LL_RCC_PLLMUL_5
  *         @arg @ref LL_RCC_PLLMUL_6
  *         @arg @ref LL_RCC_PLLMUL_7
  *         @arg @ref LL_RCC_PLLMUL_8
  *         @arg @ref LL_RCC_PLLMUL_9
  *         @arg @ref LL_RCC_PLLMUL_10
  *         @arg @ref LL_RCC_PLLMUL_11
  *         @arg @ref LL_RCC_PLLMUL_12
  *         @arg @ref LL_RCC_PLLMUL_13
  *         @arg @ref LL_RCC_PLLMUL_14
  *         @arg @ref LL_RCC_PLLMUL_15
  *         @arg @ref LL_RCC_PLLMUL_16
  *         @arg @ref LL_RCC_PLLMUL_17
  *         @arg @ref LL_RCC_PLLMUL_18
  *         @arg @ref LL_RCC_PLLMUL_19
  *         @arg @ref LL_RCC_PLLMUL_20
  *         @arg @ref LL_RCC_PLLMUL_21
  */
__STATIC_INLINE uint32_t LL_RCC_PLL_GetMulFactor(void)
{
  return (uint32_t)(READ_BIT(RCC->CFGR, RCC_CFGR_PLLMULL));
}

/**
  * @brief  Set HSE PREDIV division factor for the main PLL
  * @note They can be written only when the PLL is disabled
  * @rmtoll CFGR        PLLXTPRE      LL_RCC_PLL_SetPrediv
  * @param Prediv This parameter can be one of the following values:
  *         @arg @ref LL_RCC_PREDIV_DIV_1
  *         @arg @ref LL_RCC_PREDIV_DIV_2
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL_SetPrediv(uint32_t Prediv)
{
  MODIFY_REG(RCC->CFGR, RCC_CFGR_PLLXTPRE, Prediv);
}

/**
  * @brief  Get HSE PREDIV division factor for the main PLL
  * @note They can be written only when the PLL is disabled
  * @rmtoll CFGR        PLLXTPRE      LL_RCC_PLL_GetPrediv
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_PREDIV_DIV_1
  *         @arg @ref LL_RCC_PREDIV_DIV_2
  */
__STATIC_INLINE uint32_t LL_RCC_PLL_GetPrediv(void)
{
  return (uint32_t)READ_BIT(RCC->CFGR, RCC_CFGR_PLLXTPRE);
}

/**
  * @}
  */
#endif


